app/views/blog/posts/_post.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <h4 class="card-title"><%= link_to post.title, post %> </h4>
        <h7><%= link_to Category.find(post.category_id).name,category_path(post.category_id) %></h7>