app/views/blog/posts/show.html.erb

    <h1><%= @post.title %></h1>
    <h5><%= link_to Category.find(@post.category_id).name %></h5>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]