app/controllers/authors/posts_controller.rb

SELECT "categories".* FROM "categories"
---
    def new
        @post = current_author.posts.new
        @categories=Category.all.map{ |c| [c.name,c.id]}

INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at", "author_id", "thumb", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @post = current_author.posts.new(post_params)
        @post.category_id = params[:category_id]

        respond_to do |format|
        if @post.save

UPDATE "posts" SET "thumb" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["thumb", "berita-kucing-dengan-kekuatan-magis_20170201_114052.jpg"], ["updated_at", "2018-11-27 00:16:15.138403"], ["id", 4]]
---
    def update
        @post.category_id=params[:category_id]
        respond_to do |format|
        if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? ORDER BY "posts"."id" DESC  [["author_id", 1]]
---
        def set_post
        @post = Post.friendly.find(params[:id])