app/controllers/blog/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
        def index
            @posts = Post.most_recent.paginate(:page => params[:page], per_page: 2)