app/views/categories/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", "1"]]
---
<h3> Post under this category </h3>
<% Post.where(category_id: @category.id).each do |post| %>